# FabricSheetMinorLayoutPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetMinorLayoutPattern Property
ParameterTypeId Class See Also
---
"Minor Layout Pattern": Minor Layout Pattern
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetMinorLayoutPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetMinorLayoutPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetMinorLayoutPattern {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace